# St7EnableLoadPathTemplateVehicleLane

Enables a vehicle/lane combination within the specified load path template.

Load Path Templates

long St7EnableLoadPathTemplateVehicleLane(long uID, long TemplateID,

long Vehicle, long Lane)

Input Parameters

uID

Strand7 model file ID.

TemplateID

Load path template ID.

Vehicle

Vehicle number.

Lane

Lane number.